import { StockType } from '@/payload-types'
import { PayloadRequest } from 'payload'

export interface StockRow {
  stockID: string
  type?: string | null
  symbol?: string
  name?: string
  tradable?: boolean
  active?: boolean
  lastTradeDate?: Date | null
  lastTradePrice?: number | null
}

export const stockTypesMap: Map<string, StockType> = new Map([
  ['אג"ח היברידי קונצרני', 'איגרות חוב'],
  ['אג"ח קונצרני זר חו"ל IG', 'איגרות חוב'],
  ['אגח - השאלה', 'איגרות חוב'],
  ['אופציה', 'אופציות'],
  ['יה"ש', 'יחידת השתתפות'],
  ['יחידת השתתפות', 'יחידת השתתפות'],
  ['מניות חול - זיקה לישראל', 'מניות'],
  ['קרנות סל מניות ישראל', 'קרנות נאמנות'],
  ['אג"ח', 'איגרות חוב'],
  ['אגרות חוב', 'איגרות חוב'],
  ['אופציות מניות', 'אופציות'],
  ['הלוואות לא סחירות', 'אחר'],
  ['זכויות', 'זכויות'],
  ['כתב אופציה מניות', 'אופציות'],
  ['מניות - קרנות סל מניות חו"ל', 'קרנות נאמנות'],
  ['מניות דואליות חו"ל - דולר', 'מניות'],
  ['נע"מ', 'נייר ערך מסחרי'],
  ['אג"ח - השאלה', 'איגרות חוב'],
  ['יחידות השתתפות', 'יחידת השתתפות'],
  ['מניות יתר', 'מניות'],
  ['נייר ערך מסחרי', 'נייר ערך מסחרי'],
  ['קרן טכנולוגיה עילית', 'אחר'],
  ['קרנות סל מניות חול', 'קרנות נאמנות'],
  ['תעודות סל מנייתיות ארה"ב', 'תעודות סל'],
  ['תעודות סל שאר העולם דולר', 'תעודות סל'],
  ['תעודות סל שאר העולם יורו', 'תעודות סל'],
  ['תעודת סל', 'תעודות סל'],
  ['תעודת סל מנית חול', 'תעודות סל'],
  ['אופציה על מניה', 'אופציות'],
  ['אופציות מעוף', 'אופציות'],
  ['איגרות חוב להמרה', 'איגרות חוב'],
  ['מניות חו"ל - ארה"ב דולר', 'מניות'],
  ['מניות חול - אירופה יורו', 'מניות'],
  ['מניות ישראליות ארה"ב-דולר', 'מניות'],
  ['מניות ישראליות דואליות דולר', 'מניות'],
  ['קרן נאמנות', 'קרנות נאמנות'],
  ['שטר הון', 'שטרי הון'],
  ['ת סל אג"ח ממשלתי', 'תעודות סל'],
  ['תעודת מדד', 'תעודות סל'],
  ['תעודת סל אג"ח IG', 'תעודות סל'],
  ['כתבי אופציה', 'אופציות'],
  ['מוצר מובנה', 'אחר'],
  ['מניות לא סחירות בחו"ל', 'מניות'],
  ['מק"מ', 'מק"מ'],
  ['קרנות סל', 'קרנות נאמנות'],
  ['ריבית של אג"ח חו"ל', 'איגרות חוב'],
  ['תעודות סל אג"ח HY', 'תעודות סל'],
  ['תעודות סל אירופה יורו', 'תעודות סל'],
  ['תעודות סל ארה"ב דולר', 'תעודות סל'],
  ['אג"ח קונצרני ישראלי חו"ל', 'איגרות חוב'],
  ['אגח קונצרן', 'איגרות חוב'],
  ['איגרות חוב', 'איגרות חוב'],
  ['חוב מובנה בחו"ל - CLO דולר', 'איגרות חוב'],
  ['מניה לא סחירה', 'מניות'],
  ['מניות חו"ל - יין יפני', 'מניות'],
  ['מניות ישראליות דואליות-שטרלינג', 'מניות'],
  ['מניות לא סחירות', 'מניות'],
  ['קרן סל חו"ל', 'קרנות נאמנות'],
  ['תעודות סל', 'תעודות סל'],
  ['תעודות סל מניות חול', 'תעודות סל'],
  ['איגרות חוב', 'איגרות חוב'],
  ['אג"ח זר COCO מחיקה', 'איגרות חוב'],
  ['אג"ח לא סחיר', 'איגרות חוב'],
  ['אופציות', 'אופציות'],
  ['חוב מובנה בחו"ל - CLO יורו', 'איגרות חוב'],
  ['מניות - חוזים על סחורות', 'מניות'],
  ['מניות חו"ל - שאר העולם דולר', 'מניות'],
  ['מניות ישראליות בחול - דולר', 'מניות'],
  ['קרנות נאמנות', 'קרנות נאמנות'],
  ['ת סל אג"ח ממשלתי EM מטבע מקומי', 'תעודות סל'],
  ['תעודות סל זרות בחו"ל - דולר', 'תעודות סל'],
  ['תעודת סל מניות חו"ל', 'תעודות סל'],
  ['אגח זר COCO המרה', 'איגרות חוב'],
  ['מניה', 'מניות'],
  ['מניות', 'מניות'],
  ['קרן נאמנות/סל/השקעה', 'קרנות נאמנות'],
  ['שטרי הון', 'שטרי הון'],
  ['תעודות סל אירופה לישט', 'תעודות סל'],
  ['אג"ח קונצרני זר חו"ל HY', 'איגרות חוב'],
  ['אופציה על מניה לא סחירה', 'אופציות'],
  ['אופציות על מניות בארץ', 'אופציות'],
  ['איגרות חוב לא סחיר', 'איגרות חוב'],
  ['קרן סל', 'קרנות נאמנות'],
  ['קרנות סל שקליות', 'קרנות נאמנות'],
  ['תעודות סל אירופה דולר', 'תעודות סל'],
  ['תעודות סל יפן דולר', 'תעודות סל'],
  ['תעודות סל יפן יין', 'תעודות סל'],
  ['אג"ח היברידי פיננסי ביטוח', 'איגרות חוב'],
  ['אג"ח ממשלתיות', 'איגרות חוב'],
  ['הלוואות', 'אחר'],
  ['מניות ל"ס', 'מניות'],
  ['קרן סל מניות חו"ל', 'קרנות נאמנות'],
  ['קרנות סל מניות חו"ל', 'קרנות נאמנות'],
  ['תעודות סל זרות בחו"ל -יורו', 'תעודות סל'],
])

export function getStockType(rowType: string): StockType {
  return stockTypesMap.get((rowType || '').trim()) || 'אחר'
}

export function parseDate(dateStr: string) {
  if (!/^\d{8}$/.test(dateStr)) throw new Error('Invalid date format')
  const year = parseInt(dateStr.slice(0, 4))
  const month = parseInt(dateStr.slice(4, 6))
  const day = parseInt(dateStr.slice(6, 8))

  const date = new Date(year, month - 1, day)

  // Verify the date is valid
  if (date.getFullYear() !== year || date.getMonth() !== month - 1 || date.getDate() !== day) {
    throw new Error('Invalid date')
  }

  return date
}

export async function getStockIdToSequenceMap(req: PayloadRequest) {
  const stockMap = new Map<string, string>()
  // Prefetch common stocks to reduce database lookups
  console.log('Prefetching common stocks...')
  const stockIdToSequenceMap = await req.payload.find({
    collection: 'stocks',
    limit: 0,
    select: {
      stockId: true,
      id: true,
      relatedStock: true,
    },
    req,
    depth: 1,
  })
  for (const stock of stockIdToSequenceMap.docs) {
    if (stock.relatedStock && typeof stock.relatedStock === 'object' && 'id' in stock.relatedStock)
      stockMap.set(`${stock.stockId}`, String(stock.relatedStock.id))
    else {
      if (stock.stockId) {
        stockMap.set(`${stock.stockId}`, String(stock.id))
      }
    }
  }
  console.log(`Prefetched ${stockMap.size} stocks`)

  return stockMap
}
